cases/hydrodynamic/risingBubble/risingBubble2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// resolution 64; // 128;
// l          5.715;


defaultFieldValues
(
    volScalarFieldValue alpha.water 1
);

regions
(
    cylinderToCell
    {
          p1 (0.5 0.5 -0.5);
          p2 (0.5 0.5 0.5);
          radius 0.25;
          fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
);


// ************************************************************************* //
